 var statement; //інструкція
 statement = 5+2; // присвоїли змінній вираження "5+2"
 'kerf'; // - літерал - коли нічого присвоювати не потрібно, консольвидасть цей же запис

                                           //Оператори діляться на 5 типів

                                      //1.арифметичні (основні)
 //+
// -
// *
 ///

 //5%2   //=1 - оператор модуля

 // =    // присвоює

 var i =2;
 var b = 2;
 console.log(i++);   // = 2 ПОСТФІКСНА
 console.log(++b);// = 3 повертає стару не збільшену змінну ПРЕФІКСНА
 console.log(i); // =3

 ++i; // оператор інкримента збільшує змінну на 1
 --i; // оператор дікримента зменшує змінну на 1



                                    //2. порівняння

                                    //3.умовні

                                    //4.логічні

                                    //5.побутові - рідко використовуються