 var statement; //інструкція
 statement = 5+2; // присвоїли змінній вираження "5+2"
 'kerf'; // - літерал - коли нічого присвоювати не потрібно, консольвидасть цей же запис

                                           //Оператори діляться на 5 типів

                                      //1.арифметичні (основні)
 //+
// -
// *
 ///

 //5%2   //=1 - оператор модуля

 // =    // присвоює


 var b = 2;
 var i =2;
 //console.log(++b);// = 3
 //console.log(i--);   // = 2 ПОСТФІКСНА повертає стару не збільшену змінну ПРЕФІКСНА
 //console.log(i);  // 1

// ++i; // оператор інкримента збільшує змінну на 1
// --i; // оператор дікримента зменшує змінну на 1

// ++i; //префиксная форма записи
 //b++; //постфиксная форма записи - повертає попереднє значення - 2, наприклад
 var m =10;
 console.log(m*= 2);
  //for(var a=1, b=2, c=3; b<3; b++ ;) {   // - в одній інструкції потрібно зробити декілька дій

 //}



                                    //2. порівняння повертають true/false
 var a = 0,
     b = false;
 a < b;
 a > b;
 a >= b;
 a <= b;

 //НЕ ВИКОРИСТОВУВАТИ ЦІ ДВА(не розрізняють типи даних такі, як "0": і "false" -видасть при a == b; true)
 a == b; // равенства
 a != b; // не равенства
 //Потрібно використовувати оператори СТРОГОГО РАВЕНСТВА:
 a === b;
 a !== b;



                                     //3.умовні
 var age = 54;

 //if(age === 18){
 // alert('You are 0 boy');

 // } else if (age === 21){
 // alert('You are 1 boy');
 // } else if (age === 22){
 // alert('You are 3 boy');
 // }
 //else {
 // alert('You are not bed boy');
 // }
//ПЕРЕПИСУЄМО ЦЕ:
 //(age === 18) ? alert('You are 0 boy') :
  //              (age === 21) ? alert('You are 1 boy') :
 //               (age === 23) ? alert('You are 3 boys') :
 //                            alert('Small')


                                    //4.логічні || - или;  && - и; ! - не
 (age >= 18 || age <= 50) ? alert('Дорослий') : alert('Не підходите вимогам');
                                    //5.побутові - рідко використовуються
 console.log(typeof null);